In [1]:
import numpy as np
import pandas as pd

dict1 = {
    "name":['harry','rohan','skillf','shubh'],
    "marks":[98,76,54,32],
    "city":['raipur','delhi','lucknow','pune']
}

In [3]:
df = pd.DataFrame(dict1)
df

     name  marks     city
0   harry     98   raipur
1   rohan     76    delhi
2  skillf     54  lucknow
3   shubh     32     pune

In [4]:
# it will create friends.csv file with above data
df.to_csv('friends.csv',index='true')

df

     name  marks     city
0   harry     98   raipur
1   rohan     76    delhi
2  skillf     54  lucknow
3   shubh     32     pune

In [5]:
df.head(2)

    name  marks    city
0  harry     98  raipur
1  rohan     76   delhi

In [6]:
df.tail(2)

     name  marks     city
2  skillf     54  lucknow
3   shubh     32     pune

In [8]:
# statistical analysis
df.describe()

           marks
count   4.000000
mean   65.000000
std    28.401878
min    32.000000
25%    48.500000
50%    65.000000
75%    81.500000
max    98.000000

In [11]:
trn = pd.read_csv('train.csv')
trn

   Train No.  Speed       City
0     283782    120    Lucknow
1     278371    150       Pune
2     882981    180       Agra
3     746273    170  Rajasthan

In [12]:
trn['Speed']

0    120
1    150
2    180
3    170
Name: Speed, dtype: int64

In [13]:
trn['Speed'][1]

150

In [14]:
trn['Speed'][1] = 160
trn['Speed']

C:\Users\deepa\AppData\Local\Temp\ipykernel_25924\4220006121.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  trn['Speed'][1] = 160

0    120
1    160
2    180
3    170
Name: Speed, dtype: int64

In [19]:
trn

   Train No.  Speed       City
0     283782    120    Lucknow
1     278371    160       Pune
2     882981    180       Agra
3     746273    170  Rajasthan

In [21]:
trn.to_csv('newtrain.csv')